import { Description } from '@/components/ui/Description';
import { FAQItem } from '@/components/ui/FAQItem';
import { Title } from '@/components/ui/Title';

export const FAQ = () => {
  const questions = [
    {
      id: 1,
      question: '1. КТО ЯВЛЯЕТСЯ ОРГАНИЗАТОРОМ ЛОТЕРЕИ?',
      answer:
        'Организатором является компания "KG Loto", действующая на основании государственной лицензии Кыргызской Республики. Мы гарантируем прозрачность всех розыгрышей и своевременную выплату выигрышей согласно законодательству.',
    },
    {
      id: 2,
      question: '2. КАКИЕ БЫВАЮТ ЛОТЕРЕИ?',
      answer:
        'На нашей платформе представлены два основных типа лотерей: моментальные (вы узнаете результат сразу после стирания защитного поля) и тиражные (розыгрыш проходит в определенное время, например, ежедневно или еженедельно в прямом эфире).',
    },
    {
      id: 3,
      question: '3. КАК ПОЛУЧИТЬ ВЫИГРЫШ?',
      answer:
        'Мелкие выигрыши до 5000 сом зачисляются на ваш внутренний баланс моментально. Вы можете вывести их на карту или электронный кошелек. Крупные выигрыши (свыше 50 000 сом) выплачиваются в нашем офисе после предъявления документа, удостоверяющего личность.',
    },
    {
      id: 4,
      question: '4. МОЖНО ЛИ ИГРАТЬ БЕЗ РЕГИСТРАЦИИ?',
      answer:
        'Для участия в розыгрышах регистрация обязательна. Это необходимо для того, чтобы мы могли идентифицировать победителя и безопасно выплатить выигрыш именно вам.',
    },
    {
      id: 5,
      question: '5. ЧТО ДЕЛАТЬ, ЕСЛИ Я ЗАБЫЛ ПАРОЛЬ?',
      answer:
        'Вы можете восстановить доступ, нажав кнопку "Забыли пароль" на странице входа. Мы отправим код подтверждения на ваш номер телефона, указанный при регистрации.',
    },
  ];

  return (
    <section className='my-12'>
      {/* Заголовки */}
      <div className='mb-8'>
        <Title>
          ОТВЕТЫ НА ЧАСТЫЕ <br /> ВОПРОСЫ
        </Title>
        <Description>
          Если не нашли ответа на свой вопрос, просто спросите у нас в привычном
          мессенджере.
        </Description>
      </div>

      {/* Список вопросов */}
      <div className='flex flex-col'>
        {questions.map((item) => (
          <FAQItem
            key={item.id}
            question={item.question}
            answer={item.answer}
          />
        ))}
      </div>
    </section>
  );
};
